cf/ExchangePlans/Обмен_МДМ_УПП.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.5">
	<ExchangePlan>
		<Properties>
			<Name>Обмен_МДМ_УПП</Name>
		</Properties>
		<ChildObjects>
			<Attribute>
				<Properties>
					<Name>Организация</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Организации</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>SAP</Name>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Attribute>
		</ChildObjects>
	</ExchangePlan>
</MetaDataObject>

cf/InformationRegisters/УчастникиОбмена.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.5">
	<InformationRegister>
		<Properties>
			<Name>УчастникиОбмена</Name>
			<InformationRegisterPeriodicity>Nonperiodical</InformationRegisterPeriodicity>
			<WriteMode>Independent</WriteMode>
		</Properties>
		<ChildObjects>
			<Resource>
				<Properties>
					<Name>Обмен</Name>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>ОбменВладелец</Name>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Resource>
			<Dimension>
				<Properties>
					<Name>ОбъектОбмена</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.нсиМТР</v8:Type>
						<v8:Type>cfg:CatalogRef.нсиКонтрагенты</v8:Type>
						<v8:Type>cfg:CatalogRef.ДоговорыКонтрагентов</v8:Type>
						<v8:Type>cfg:CatalogRef.Организации</v8:Type>
						<v8:Type>cfg:CatalogRef.Склады</v8:Type>
						<v8:Type>cfg:CatalogRef.СпецификацииНоменклатуры</v8:Type>
					</Type>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<Name>УзелОбмена</Name>
					<Type>
						<v8:Type>cfg:ExchangePlanRef.Обмен_МДМ_УПП</v8:Type>
					</Type>
				</Properties>
			</Dimension>
		</ChildObjects>
	</InformationRegister>
</MetaDataObject>

cf/InformationRegisters/КонтактнаяИнформация.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.5">
	<InformationRegister>
		<Properties>
			<Name>КонтактнаяИнформация</Name>
			<InformationRegisterPeriodicity>Nonperiodical</InformationRegisterPeriodicity>
			<WriteMode>Independent</WriteMode>
		</Properties>
		<ChildObjects>
			<Resource>
				<Properties>
					<Name>Представление</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>0</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>Поле1</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>100</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>Поле2</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>100</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>Поле3</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>100</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>Поле4</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>100</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>Поле5</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>100</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>Поле6</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>100</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>Поле7</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>350</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>Поле8</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>100</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>Поле9</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>100</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>Поле10</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>200</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>Комментарий</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>0</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>ЗначениеПоУмолчанию</Name>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>Округ</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>100</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>ВнутригородскойРайон</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>100</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>ТипДома</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>50</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>ТипСтроения</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>50</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>ТипПомещения</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>50</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Dimension>
				<Properties>
					<Name>Объект</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.нсиКонтрагенты</v8:Type>
						<v8:Type>cfg:CatalogRef.алкПунктыРазгрузки</v8:Type>
						<v8:Type>cfg:CatalogRef.Организации</v8:Type>
					</Type>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<Name>Тип</Name>
					<Type>
						<v8:Type>cfg:EnumRef.ТипыКонтактнойИнформации</v8:Type>
					</Type>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<Name>Вид</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:Type>cfg:CatalogRef.ВидыКонтактнойИнформации</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>50</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Dimension>
		</ChildObjects>
	</InformationRegister>
</MetaDataObject>

cf/Catalogs/СпецификацииНоменклатуры.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.5">
	<Catalog>
		<Properties>
			<Name>СпецификацииНоменклатуры</Name>
			<Comment>(Общ)</Comment>
			<Hierarchical>true</Hierarchical>
			<HierarchyType>HierarchyFoldersAndItems</HierarchyType>
		</Properties>
		<ChildObjects>
			<Attribute>
				<Properties>
					<Name>Состояние</Name>
					<Comment>(Общ)</Comment>
					<Type>
						<v8:Type>cfg:EnumRef.СостоянияОбъектов</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ДатаУтверждения</Name>
					<Comment>(Общ)</Comment>
					<Type>
						<v8:Type>xs:dateTime</v8:Type>
						<v8:DateQualifiers>
							<v8:DateFractions>Date</v8:DateFractions>
						</v8:DateQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ВидСпецификации</Name>
					<Type>
						<v8:Type>cfg:EnumRef.ВидыСпецификаций</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Активная</Name>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>КодВерсии</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>5</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Ответственный</Name>
					<Comment>(Общ)</Comment>
					<Type>
						<v8:Type>cfg:CatalogRef.Пользователи</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>СтранаИмпортер</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.СтраныМира</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Номенклатура</Name>
					<Comment>(Общ)</Comment>
					<Type>
						<v8:Type>cfg:CatalogRef.нсиМТР</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ПроизводственнаяПлощадка</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Организации</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ДатаНачалаДействия</Name>
					<Type>
						<v8:Type>xs:dateTime</v8:Type>
						<v8:DateQualifiers>
							<v8:DateFractions>Date</v8:DateFractions>
						</v8:DateQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ДатаОкончанияДействия</Name>
					<Type>
						<v8:Type>xs:dateTime</v8:Type>
						<v8:DateQualifiers>
							<v8:DateFractions>Date</v8:DateFractions>
						</v8:DateQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Склад</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Склады</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ТипСпецификации</Name>
					<Type>
						<v8:Type>cfg:EnumRef.ТипыСпецификаций</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Дистрибьютор</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.нсиКонтрагенты</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ТипПозиции</Name>
					<Comment>Эталон/Дубль/Одиночная позиция</Comment>
					<Type>
						<v8:Type>cfg:EnumRef.нсиТипыПозицийСправочников</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ЭталоннаяПозиция</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.СпецификацииНоменклатуры</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ПризнакИспользования</Name>
					<Type>
						<v8:Type>cfg:EnumRef.нсиПризнакиИспользованияПозиций</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ТочкаМаршрута</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.ТочкиМаршрута</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>КодСпецификацииВУчетнойСистеме</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>20</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Комментарий</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>0</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<TabularSection>
				<Properties>
					<Name>ИсходныеКомплектующие</Name>
				</Properties>
				<ChildObjects>
					<Attribute>
						<Properties>
							<Name>Номенклатура</Name>
							<Comment>(Общ)</Comment>
							<Type>
								<v8:Type>cfg:CatalogRef.нсиМТР</v8:Type>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>Количество</Name>
							<Comment>(Общ)</Comment>
							<Type>
								<v8:Type>xs:decimal</v8:Type>
								<v8:NumberQualifiers>
									<v8:Digits>15</v8:Digits>
									<v8:FractionDigits>5</v8:FractionDigits>
								</v8:NumberQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>ЕдиницаИзмерения</Name>
							<Comment>(Общ)</Comment>
							<Type>
								<v8:Type>cfg:CatalogRef.ЕдиницыИзмерения</v8:Type>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>СтатьяЗатрат</Name>
							<Comment>(Общ)</Comment>
							<Type>
								<v8:Type>cfg:CatalogRef.итСтатьиЗатрат</v8:Type>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>Кратность</Name>
							<Type>
								<v8:Type>xs:decimal</v8:Type>
								<v8:NumberQualifiers>
									<v8:Digits>15</v8:Digits>
									<v8:FractionDigits>3</v8:FractionDigits>
								</v8:NumberQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>ТипКомплектации</Name>
							<Type>
								<v8:Type>cfg:CatalogRef.ТипКомплектации</v8:Type>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>ГосНормативПотерь</Name>
							<Type>
								<v8:Type>xs:decimal</v8:Type>
								<v8:NumberQualifiers>
									<v8:Digits>4</v8:Digits>
									<v8:FractionDigits>2</v8:FractionDigits>
								</v8:NumberQualifiers>
							</Type>
						</Properties>
					</Attribute>
				</ChildObjects>
			</TabularSection>
			<TabularSection>
				<Properties>
					<Name>ВыходныеИзделия</Name>
				</Properties>
				<ChildObjects>
					<Attribute>
						<Properties>
							<Name>Номенклатура</Name>
							<Comment>(Общ)</Comment>
							<Type>
								<v8:Type>cfg:CatalogRef.нсиМТР</v8:Type>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>Количество</Name>
							<Comment>(Общ)</Comment>
							<Type>
								<v8:Type>xs:decimal</v8:Type>
								<v8:NumberQualifiers>
									<v8:Digits>15</v8:Digits>
									<v8:FractionDigits>3</v8:FractionDigits>
								</v8:NumberQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>ЕдиницаИзмерения</Name>
							<Comment>(Общ)</Comment>
							<Type>
								<v8:Type>cfg:CatalogRef.ЕдиницыИзмерения</v8:Type>
							</Type>
						</Properties>
					</Attribute>
				</ChildObjects>
			</TabularSection>
		</ChildObjects>
	</Catalog>
</MetaDataObject>

cf/ExchangePlans/Обмен_МДМ_УПП/Ext/ManagerModule.bsl
Процедура ВыполнитьРегистрациюДляУПП(Ссылка, РегистрацияПолногоНабора = Ложь) экспорт

	ПринадлежитУПП = Метаданные.ПланыОбмена.Обмен_МДМ_УПП.Состав.Содержит(Ссылка.Метаданные());
	
	Если НЕ ПринадлежитУПП Тогда
		Возврат;
	КонецЕсли;
	
	ТаблицаУзловОбмена = ПолучитьУзлыОбменаУПП(Ссылка);
	
	Если ТаблицаУзловОбмена.Количество() Тогда
		
		УзлыОбменаРегистрация = ПолучитьМассивУзлов(ТаблицаУзловОбмена, Истина);
		
		Если УзлыОбменаРегистрация.Количество() Тогда
			
			ПолнаяСинхронизация = ПолнаяСинхронизация(Ссылка);
			
			Если ПолнаяСинхронизация Тогда
				ПланыОбмена.ЗарегистрироватьИзменения(УзлыОбменаРегистрация, Ссылка);
			Иначе
				ПланыОбмена.УдалитьРегистрациюИзменений(УзлыОбменаРегистрация, Ссылка);
			КонецЕсли; 
			
			Если НЕ ПолнаяСинхронизация 
				ИЛИ (ПолнаяСинхронизация И РегистрацияПолногоНабора) Тогда
				РегистрацияСправочниковВладельца(Ссылка, УзлыОбменаРегистрация, ПолнаяСинхронизация);
			КонецЕсли; 
			
			РегистрацияКонтактнойИнформации(Ссылка, УзлыОбменаРегистрация, ПолнаяСинхронизация);			
			
		КонецЕсли; 
		
		УзлыОбменаУдаление = ПолучитьМассивУзлов(ТаблицаУзловОбмена, Ложь);
		
		Если УзлыОбменаУдаление.Количество() Тогда
			
			ПланыОбмена.УдалитьРегистрациюИзменений(УзлыОбменаУдаление, Ссылка);
			
			РегистрацияСправочниковВладельца(Ссылка, УзлыОбменаУдаление);
			
			РегистрацияКонтактнойИнформации(Ссылка, УзлыОбменаУдаление);
			
		КонецЕсли; 
		
	КонецЕсли;

КонецПроцедуры

Функция ПолучитьМассивУзлов(ТаблицаУзловОбмена, Обмен)

	Отбор = Новый Структура;
	Отбор.Вставить("Обмен",Обмен);
	СтрокиДляРегистрации = ТаблицаУзловОбмена.НайтиСтроки(Отбор);
	МассивУзлов = Новый Массив;
	Для каждого СтрокаДляРегистрации Из СтрокиДляРегистрации Цикл
		МассивУзлов.Добавить(СтрокаДляРегистрации.Узел);
	КонецЦикла;
	
	Возврат МассивУзлов;

КонецФункции // ПолучитьМассивУзлов()

Функция ПолнаяСинхронизация(Ссылка)
	
	СсылкаДляОбработки = Ссылка;
	Если ТипЗнч(Ссылка) = Тип("СправочникСсылка.ЕдиницыИзмерения") Тогда
		СсылкаДляОбработки = Ссылка.Владелец;
	КонецЕсли;
	
	ЭлементСостава = Метаданные.ОбщиеРеквизиты.ПолнаяСинхронизацияMDM.Состав.Найти(СсылкаДляОбработки.Метаданные());
	
	Использование = ЭлементСостава.Использование = Метаданные.СвойстваОбъектов.ИспользованиеОбщегоРеквизита.Использовать;
	
	Возврат НЕ Использование
			ИЛИ (Использование И СсылкаДляОбработки.ПолнаяСинхронизацияMDM);
		
КонецФункции // СсылкаПолнаяСинхронизация()
 
Функция ПреобразоватьСсылкуПоВладельцу(Ссылка, ФункцияПолнаяСинхронизация = Ложь) Экспорт 

	ЕдиницыИзмерения=Тип("СправочникСсылка.ЕдиницыИзмерения");
	ПунктыРазгрузки=Тип("СправочникСсылка.алкПунктыРазгрузки");
	Лицензии=Тип("СправочникСсылка.алкЛицензии");
	БанковскиеСчета=Тип("СправочникСсылка.нсиБанковскиеСчета");
	Договоры=Тип("СправочникСсылка.ДоговорыКонтрагентов");
	Спецификации=Тип("СправочникСсылка.СпецификацииНоменклатуры");
	КонтактнаяИнформация = Тип("РегистрСведенийНаборЗаписей.КонтактнаяИнформация");
	
	СсылкаКопия = Ссылка;
	
	Если ТипЗнч(Ссылка)=ЕдиницыИзмерения 
		ИЛИ ТипЗнч(Ссылка)=ПунктыРазгрузки 
		ИЛИ ТипЗнч(Ссылка)=Лицензии 
		ИЛИ ТипЗнч(Ссылка)=БанковскиеСчета 
		Тогда
		СсылкаКопия=Ссылка.Владелец;    
	ИначеЕсли ТипЗнч(Ссылка)=Спецификации
		И ФункцияПолнаяСинхронизация Тогда 
		СсылкаКопия=Ссылка.Номенклатура;        
	ИначеЕсли ТипЗнч(Ссылка)=КонтактнаяИнформация Тогда 
		СсылкаКопия=ПреобразоватьСсылкуПоВладельцу(Ссылка.Отбор.Объект.Значение);        
	ИначеЕсли ТипЗнч(Ссылка)=Договоры 
		И ФункцияПолнаяСинхронизация Тогда 
		СсылкаКопия=Ссылка.Владелец;    
	КонецЕсли;
	
	Возврат СсылкаКопия; 

КонецФункции // ПреобразоватьСсылкуПоВладельцу()

Функция ПолучитьУзлыОбменаУПП(ОбъектОбмена) Экспорт 

	СсылкаВладелец = ПреобразоватьСсылкуПоВладельцу(ОбъектОбмена);
	
	Запрос=Новый Запрос;
	Если ТипЗнч(СсылкаВладелец) = Тип("СправочникСсылка.ДоговорыКонтрагентов")
		ИЛИ ТипЗнч(СсылкаВладелец) = Тип("СправочникСсылка.СпецификацииНоменклатуры") Тогда
		
		Запрос.Текст="ВЫБРАТЬ
		             |	УчастникиОбмена.УзелОбмена,
		             |	УчастникиОбмена.Обмен
		             |ПОМЕСТИТЬ УчастникиОбменаВладелец
		             |ИЗ
		             |	РегистрСведений.УчастникиОбмена КАК УчастникиОбмена
		             |ГДЕ
		             |	УчастникиОбмена.ОбъектОбмена = &ОбъектОбменаВладелец
		             |;
		             |
		             |////////////////////////////////////////////////////////////////////////////////
		             |ВЫБРАТЬ
		             |	УчастникиОбмена.УзелОбмена,
		             |	УчастникиОбмена.Обмен
		             |ПОМЕСТИТЬ УчастникиОбмена
		             |ИЗ
		             |	РегистрСведений.УчастникиОбмена КАК УчастникиОбмена
		             |ГДЕ
		             |	УчастникиОбмена.ОбъектОбмена = &ОбъектОбмена
		             |;
		             |
		             |////////////////////////////////////////////////////////////////////////////////
		             |ВЫБРАТЬ
		             |	ЕСТЬNULL(УчастникиОбмена.Обмен, ЛОЖЬ)
		             |		И УчастникиОбменаВладелец.Обмен КАК Обмен,
		             |	УчастникиОбменаВладелец.УзелОбмена КАК Узел
		             |ИЗ
		             |	УчастникиОбменаВладелец КАК УчастникиОбменаВладелец
		             |		ЛЕВОЕ СОЕДИНЕНИЕ УчастникиОбмена КАК УчастникиОбмена
		             |		ПО УчастникиОбменаВладелец.УзелОбмена = УчастникиОбмена.УзелОбмена";
		
		Если ТипЗнч(СсылкаВладелец) = Тип("СправочникСсылка.ДоговорыКонтрагентов") Тогда
			ИмяРеквизита = "Владелец";
		ИначеЕсли ТипЗнч(СсылкаВладелец) = Тип("СправочникСсылка.СпецификацииНоменклатуры") Тогда
			ИмяРеквизита = "Номенклатура";
		КонецЕсли; 
		Запрос.УстановитьПараметр("ОбъектОбменаВладелец", СсылкаВладелец[ИмяРеквизита]);
	Иначе
		
		Запрос.Текст="ВЫБРАТЬ
		             |	УчастникиОбмена.УзелОбмена КАК Узел,
		             |	УчастникиОбмена.Обмен
		             |ИЗ
		             |	РегистрСведений.УчастникиОбмена КАК УчастникиОбмена
		             |ГДЕ
		             |	УчастникиОбмена.ОбъектОбмена = &ОбъектОбмена"
		
	КонецЕсли; 
	
	Запрос.УстановитьПараметр("ОбъектОбмена", СсылкаВладелец);
	Результат = Запрос.Выполнить().Выгрузить();
	
	УдалитьУзелSAP(Результат, ОбъектОбмена);
	
	Возврат Результат;

КонецФункции // ПолучитьУзлыОбмена()

Процедура УдалитьУзелSAP(ТаблицаУзлов, Ссылка) Экспорт 
	
	ЕдиницыИзмерения=Тип("СправочникСсылка.ЕдиницыИзмерения");
	Договоры=Тип("СправочникСсылка.ДоговорыКонтрагентов");
	Спецификации=Тип("СправочникСсылка.СпецификацииНоменклатуры");
	КонтактнаяИнформация = Тип("РегистрСведенийНаборЗаписей.КонтактнаяИнформация");
	
	Если ТипЗнч(Ссылка)=ЕдиницыИзмерения 
		ИЛИ ТипЗнч(Ссылка)=Договоры 
		ИЛИ ТипЗнч(Ссылка)=КонтактнаяИнформация 
		ИЛИ ТипЗнч(Ссылка)=Спецификации Тогда
		
		Если ТаблицаУзлов.Количество() Тогда
			УзелSAP = УзелSAP();
			Если ЗначениеЗаполнено(УзелSAP) Тогда
				НайденнаяСтрока = ТаблицаУзлов.Найти(УзелSAP,"Узел");
				Если НЕ НайденнаяСтрока = Неопределено Тогда
					ТаблицаУзлов.Удалить(НайденнаяСтрока);
				КонецЕсли;
			КонецЕсли; 
		КонецЕсли; 
	КонецЕсли; 

КонецПроцедуры

Функция УзелSAP() Экспорт 

	Возврат ПланыОбмена.Обмен_МДМ_УПП.НайтиПоРеквизиту("SAP", Истина);

КонецФункции // УзелSAP()
 
Процедура ВыполнитьРегистрациюКонтактнойИнформации(НаборЗаписейКИ, УзлыОбмена, Регистрация) Экспорт 

	ИзмеренияТЗ = НаборЗаписейКИ.Выгрузить(,"Объект, Вид, Тип");
	ИзмеренияТЗ.Свернуть("Объект, Вид, Тип");
	
	Для каждого СтрокаИзмерений Из ИзмеренияТЗ Цикл
		
		Для каждого КолонкаТЗ Из ИзмеренияТЗ.Колонки Цикл
			НаборЗаписейКИ.Отбор[КолонкаТЗ.Имя].Установить(СтрокаИзмерений[КолонкаТЗ.Имя]);
		КонецЦикла; 
		
		Если Регистрация Тогда
			ПланыОбмена.ЗарегистрироватьИзменения(УзлыОбмена, НаборЗаписейКИ);
		Иначе
			ПланыОбмена.УдалитьРегистрациюИзменений(УзлыОбмена, НаборЗаписейКИ);
		КонецЕсли; 
		
	КонецЦикла; 
	
КонецПроцедуры // ВыполнитьРегистрациюКонтактнойИнформации(УзелОбмена, ОбъектОбмена, Обмен)()

Процедура РегистрацияКонтактнойИнформации(ОбъектОбмена, УзлыОбмена = Неопределено, Регистрация = Ложь) Экспорт 

	Если ТипЗнч(ОбъектОбмена) = Тип("СправочникСсылка.нсиКонтрагенты")
		ИЛИ ТипЗнч(ОбъектОбмена) = Тип("СправочникСсылка.Организации") 
		ИЛИ ТипЗнч(ОбъектОбмена) = Тип("СправочникСсылка.алкПунктыРазгрузки") 
		Тогда	
		
		НаборЗаписейКИ = РегистрыСведений.КонтактнаяИнформация.СоздатьНаборЗаписей();
		НаборЗаписейКИ.Отбор.Объект.Установить(ОбъектОбмена);
		НаборЗаписейКИ.Прочитать();
		
		ВыполнитьРегистрациюКонтактнойИнформации(НаборЗаписейКИ, УзлыОбмена, Регистрация);
		
	КонецЕсли;
	
КонецПроцедуры // ВыполнитьРегистрациюКонтактнойИнформации(УзелОбмена, ОбъектОбмена, Обмен)()

Процедура РегистрацияСправочниковВладельца(Владелец, УзлыОбмена = Неопределено, Регистрация = Ложь) Экспорт 

	Если ТипЗнч(Владелец) = Тип("СправочникСсылка.нсиМТР") Тогда
		
		СправочникиВладельца = Новый Структура;
		СправочникиВладельца.Вставить("ЕдиницыИзмерения");
		СправочникиВладельца.Вставить("СпецификацииНоменклатуры");
		
	ИначеЕсли ТипЗнч(Владелец) = Тип("СправочникСсылка.нсиКонтрагенты")
		ИЛИ ТипЗнч(Владелец) = Тип("СправочникСсылка.Организации") 
		Тогда	
		
		СправочникиВладельца = Новый Структура;
		СправочникиВладельца.Вставить("алкЛицензии");
		СправочникиВладельца.Вставить("алкПунктыРазгрузки");
		СправочникиВладельца.Вставить("нсиБанковскиеСчета");
		
		Если ТипЗнч(Владелец) = Тип("СправочникСсылка.нсиКонтрагенты") Тогда
			СправочникиВладельца.Вставить("ДоговорыКонтрагентов");
		КонецЕсли;
	Иначе	
		Возврат;
	КонецЕсли;
	
	Для каждого СправочникВладельца Из СправочникиВладельца Цикл
		Если СправочникВладельца.Ключ = "СпецификацииНоменклатуры" Тогда
			
			Запрос = Новый Запрос;
			Запрос.Текст = 
			"ВЫБРАТЬ
			|	СпецификацииНоменклатуры.Ссылка
			|ИЗ
			|	Справочник.СпецификацииНоменклатуры КАК СпецификацииНоменклатуры
			|ГДЕ
			|	СпецификацииНоменклатуры.Номенклатура = &Номенклатура";
			
			Запрос.УстановитьПараметр("Номенклатура", Владелец);
			
			РезультатЗапроса = Запрос.Выполнить();
			
			Выборка = РезультатЗапроса.Выбрать();
			
		Иначе
			Выборка = Справочники[СправочникВладельца.Ключ].Выбрать(,Владелец);
		КонецЕсли; 
		
		//УсловиеСамостоятельнойРегистрации = (СправочникВладельца.Ключ = "СпецификацииНоменклатуры" 
		//									ИЛИ СправочникВладельца.Ключ = "ДоговорыКонтрагентов") И Регистрация;
					
		Пока Выборка.Следующий() Цикл
			
			Если СправочникВладельца.Ключ = "ЕдиницыИзмерения" Тогда
				Если Регистрация Тогда
					ПланыОбмена.ЗарегистрироватьИзменения(УзлыОбмена, Выборка.Ссылка);
				Иначе
					ПланыОбмена.УдалитьРегистрациюИзменений(УзлыОбмена, Выборка.Ссылка);
				КонецЕсли;
			Иначе
				ВыполнитьРегистрациюДляУПП(Выборка.Ссылка);
			КонецЕсли; 
			
			//Если УзлыОбмена = Неопределено ИЛИ УсловиеСамостоятельнойРегистрации Тогда
			//	ВыполнитьРегистрациюДляУПП(Выборка.Ссылка);
			//Иначе
			//	Если Регистрация Тогда
			//		ПланыОбмена.ЗарегистрироватьИзменения(УзлыОбмена, Выборка.Ссылка);
			//	Иначе
			//		ПланыОбмена.УдалитьРегистрациюИзменений(УзлыОбмена, Выборка.Ссылка);
			//	КонецЕсли;
			//	РегистрацияКонтактнойИнформации(Выборка.Ссылка, УзлыОбмена, Регистрация);
			//КонецЕсли; 
		
		КонецЦикла;
		
	КонецЦикла; 

КонецПроцедуры
